In [3]:
pip install PyMySQL

Note: you may need to restart the kernel to use updated packages.

  WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x00000190A3783750>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /packages/0c/94/e4181a1f6286f545507528c78016e00065ea913276888db2262507693ce5/PyMySQL-1.1.1-py3-none-any.whl.metadata

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Defaulting to user installation because normal site-packages is not writeable
Collecting PyMySQL
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
Installing collected packages: PyMySQL
Successfully installed PyMySQL-1.1.1

In [4]:
import pymysql as py
print("done")

done

In [14]:
con = py.connect(user = "root",
           password = "Govind@0211",
           host = "LocalHost",
           autocommit = True)
print("Connect hai !!!!")

Connect hai !!!!

In [6]:
cur = con.cursor()
print("Done")

Done

In [17]:
# q = '''select * from bca1'''
# cur.execute(q)
# for i in cur:
#     print(i)

(101, 'Mohan sharma', 'BCA', 'Delhi janakpuri', 51555.0)
(102, 'Navi verma ', 'MCA', 'South africa', 5555.0)

In [19]:

# sid = int(input("Enter Roll no: "))
# name = input("Enter your Name: ")
# course = input("Enter your Course Name: ")
# address = input("Enter Your Address: ")
# scolorship = input("Enter your Scholarship Amount: ")
# q = f'''insert into bca1 values({sid},'{name}','{course}','{address}',{scolorship})'''
# cur.execute(q)

Enter Roll no:  103
Enter your Name:  Govind
Enter your Course Name:  BCA
Enter Your Address:  Manak Pura
Enter your Scholarship Amount:  3000

1

In [ ]:
n = 3
for i in range(n):
    sid = int(input("Enter Roll no: "))
#     name = input("Enter your Name: ")
#     course = input("Enter your Course Name: ")
#     address = input("Enter Your Address: ")
#     scolorship = input("Enter your Scholarship Amount: ")
#     q = f'''insert into bca1 values({sid},'{name}','{course}','{address}',{scolorship})'''

# cur.execute(q)

In [30]:
q = '''select * from bca1'''
cur.execute(q)

rec = cur.fetchall()
import pandas as pd 
pd.DataFrame(rec)

     0             1    2                3        4
0  101  Mohan sharma  BCA  Delhi janakpuri  51555.0
1  102   Navi verma   MCA     South africa   5555.0
2  103        Govind  BCA       Manak Pura   3000.0

In [33]:
all_records = []
for i in cur.description:
    all_records.append(i[0])

import pandas as pd 
pd.DataFrame(rec,columns=all_records)

   SID  Student_Name Course          Address  Scholorships
0  101  Mohan sharma    BCA  Delhi janakpuri       51555.0
1  102   Navi verma     MCA     South africa        5555.0
2  103        Govind    BCA       Manak Pura        3000.0

In [1]:
def show_record(db,table):
    query = f'''select * from {db}.{table};'''
    cur.execute(query)
    
    rec = cur.fetchall()
    
    all_columns = []
    
    for i in  cur.description:
        all_columns.append(i[0])
    
    import pandas as pd
    df=pd.DataFrame(rec,columns=all_columns)
Â Â Â Â returnÂ df

SyntaxError: invalid non-printable character U+00A0 (538566166.py, line 14)